# üïµÔ∏è‚Äç‚ôÄÔ∏è An√°lisis Exploratorio Preliminar (EDA): Banco

## üìã Descripci√≥n
Este notebook es el **punto de partida**. Su objetivo es realizar una radiograf√≠a inicial del archivo crudo de marketing (`bank-additional.csv`) para detectar problemas de calidad antes de intentar limpiarlos.

## üìÇ Datos
* **Fuente:** `../data/bank-additional.csv` (Datos Crudos / Raw).
* **Herramienta:** Librer√≠a personalizada `src.sp_eda`.

## ‚öôÔ∏è Pasos del An√°lisis
1.  **Carga de Datos:** Lectura del CSV original.
2.  **Auditor√≠a Autom√°tica (`se.eda_preliminar`):**
    * Visualizaci√≥n de muestra aleatoria.
    * Detecci√≥n de tipos de datos incorrectos (ej: n√∫meros guardados como texto).
    * Conteo de valores nulos y duplicados.
    * Revisi√≥n de valores √∫nicos en columnas de texto (para ver si hay 'unknown' o formatos raros).

In [4]:
# -------------------------------------------------------------------------
# CARGA DEL ARCHIVO BANK-ADDITIONAL.CSV
# -------------------------------------------------------------------------
# tratamiento de dados
import pandas as pd
pd.set_option('display.max_columns', None)
#-------------------------------

# exploracion de archivos
import sys
sys.path.append('../')
#-------------------------------

#funciones personalizadas
from src import sp_eda as se
#-------------------------------

In [5]:
# carga de datos
df = pd.read_csv("../data/bank-additional.csv")

In [6]:
# exploracion preliminar
se.eda_preliminar(df)

--- 1. MUESTRA ALEATORIA ---

,Unnamed: 0,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
1406,1503,44.0,blue-collar,SINGLE,basic.9y,NaN,0.0,0.0,telephone,122,2,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,855",5191,no,12-octubre-2018,48.496,-105.796,d3a74eb2-453a-4c5f-a400-4bcea6731398
15432,15529,45.0,housemaid,DIVORCED,basic.4y,NaN,1.0,0.0,cellular,183,2,999,0,NONEXISTENT,1.4,"93,918","-42,7","4,957","5228,1",no,18-diciembre-2015,26.539,-77.153,ecb47744-7515-49f5-94a2-9353bf84374d
26045,26167,NaN,admin.,SINGLE,university.degree,0.0,1.0,1.0,cellular,844,2,999,0,NONEXISTENT,-0.1,"93,2",-42,"4,12","5195,8",no,31-mayo-2017,43.224,-71.299,7d5fe4c3-5238-46b9-9738-77d94532111e
41205,26962,33.0,admin.,SINGLE,university.degree,0.0,1.0,0.0,cellular,182,2,999,0,NONEXISTENT,-0.1,"93,2",-42,"4,076","5195,8",no,12-octubre-2016,47.162,-83.645,c9dd2fc6-64ba-4ea0-a318-d61a3555f7f4
17437,17534,54.0,admin.,MARRIED,university.degree,NaN,1.0,0.0,cellular,121,2,999,0,NONEXISTENT,1.4,"93,918","-42,7","4,962","5228,1",no,29-abril-2019,34.929,-115.087,c3cbb6bb-fce2-451c-89db-15cf755b6ded

--- 2. DIMENSIONES ---
Filas: 43000 | Columnas: 24

--- 3. INFO GENERAL ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43000 entries, 0 to 42999
Data columns (total 24 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      43000 non-null  int64
 1   age             37880 non-null  float64
 2   job             42655 non-null  object
 3   marital         42915 non-null  object
 4   education       41193 non-null  object
 5   default         34019 non-null  float64
 6   housing         41974 non-null  float64
 7   loan            41974 non-null  float64
 8   contact         43000 non-null  object
 9   duration        43000 non-null  int64
 10  campaign        43000 non-null  int64
 11  pdays           43000 non-null  int64
 12  previous        43000 non-null  int64
 13  poutcome        43000 non-null  object
 14  emp.var.rate    43000 non-null  float64
 15  cons.price.idx  42529 non-null  object
 16  cons.conf.idx   43000 non-null  object
 17  euribor3m       33744 non-null  object
 18  nr.employed     43000 non-null  object
 19  y               43000 non-null  object
 20  date            42752 non-null  object
 21  latitude        43000 non-null  float64
 22  longitude       43000 non-null  float64
 23  id_             43000 non-null  object
dtypes: float64(7), int64(5), object(12)
memory usage: 7.9+ MB

--- 4. NULOS ---

euribor3m         21.525581
default           20.886047
age               11.906977
education          4.202326
loan               2.386047
housing            2.386047
cons.price.idx     1.095349
job                0.802326
date               0.576744
marital            0.197674
dtype: float64

--- 5. DUPLICADOS ---
‚úÖ No hay filas duplicadas.

--- 6. ESTAD√çSTICAS NUM√âRICAS ---

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,43000.0,20651.099047,11868.770913,0.000,10381.75000,20642.5000,30930.25000,41187.000
age,37880.0,39.977112,10.437957,17.000,32.00000,38.0000,47.00000,98.000
default,34019.0,0.000088,0.009390,0.000,0.00000,0.0000,0.00000,1.000
housing,41974.0,0.535998,0.498708,0.000,0.00000,1.0000,1.00000,1.000
loan,41974.0,0.155620,0.362499,0.000,0.00000,0.0000,0.00000,1.000
duration,43000.0,257.739279,258.666033,0.000,102.00000,179.0000,319.00000,4918.000
campaign,43000.0,2.567233,2.772294,1.000,1.00000,2.0000,3.00000,56.000
pdays,43000.0,962.330953,187.260394,0.000,999.00000,999.0000,999.00000,999.000
previous,43000.0,0.174023,0.497366,0.000,0.00000,0.0000,0.00000,7.000
emp.var.rate,43000.0,0.077128,1.573898,-3.400,-1.80000,1.1000,1.40000,1.400
latitude,43000.0,36.856697,7.225948,24.396,30.61475,36.7610,43.11325,49.384
longitude,43000.0,-95.939067,16.752282,-124.997,-110.49425,-95.8995,-81.42775,-66.937

--- 7. COLUMNAS DE TEXTO (Top 10 valores) ---

-> Columna: JOB (Total √∫nicos: 11)

           Valor  Frecuencia
0         admin.       10873
1    blue-collar        9654
2     technician        7026
3       services        4162
4     management        3050
5        retired        1790
6   entrepreneur        1522
7  self-employed        1489
8      housemaid        1123
9     unemployed        1063

   (Se muestran solo los 10 primeros de 11)

-> Columna: MARITAL (Total √∫nicos: 3)

      Valor  Frecuencia
0   MARRIED       25999
1    SINGLE       12105
2  DIVORCED        4811

-> Columna: EDUCATION (Total √∫nicos: 7)

                 Valor  Frecuencia
0    university.degree       12722
1          high.school        9925
2             basic.9y        6309
3  professional.course        5477
4             basic.4y        4356
5             basic.6y        2386
6           illiterate          18

-> Columna: CONTACT (Total √∫nicos: 2)

       Valor  Frecuencia
0   cellular       27396
1  telephone       15604

-> Columna: POUTCOME (Total √∫nicos: 3)

         Valor  Frecuencia
0  NONEXISTENT       37103
1      FAILURE        4461
2      SUCCESS        1436

-> Columna: CONS.PRICE.IDX (Total √∫nicos: 26)

    Valor  Frecuencia
0  93,994        7938
1  93,918        6937
2  92,893        5985
3  93,444        5349
4  94,465        4522
5    93,2        3731
6  93,075        2552
7  92,201         803
8  92,963         742
9  92,431         471

   (Se muestran solo los 10 primeros de 26)

-> Columna: CONS.CONF.IDX (Total √∫nicos: 26)

   Valor  Frecuencia
0  -36,4        8020
1  -42,7        7004
2  -46,2        6057
3  -36,1        5408
4  -41,8        4568
5    -42        3782
6  -47,1        2581
7  -31,4         815
8  -40,8         748
9  -26,9         477

   (Se muestran solo los 10 primeros de 26)

-> Columna: EURIBOR3M (Total √∫nicos: 309)

   Valor  Frecuencia
0  4,857        2287
1  4,962        2124
2  4,963        2019
3  4,961        1594
4  4,964         964
5  4,856         961
6  1,405         954
7  4,864         871
8  4,965         866
9   4,96         836

   (Se muestran solo los 10 primeros de 309)

-> Columna: NR.EMPLOYED (Total √∫nicos: 11)

    Valor  Frecuencia
0  5228,1       16980
1  5099,1        8937
2    5191        8020
3  5195,8        3830
4  5076,2        1748
5  5017,5        1133
6  4991,6         812
7  5008,7         683
8  4963,6         665
9  5023,5         181

   (Se muestran solo los 10 primeros de 11)

-> Columna: Y (Total √∫nicos: 2)

  Valor  Frecuencia
0    no       38156
1   yes        4844

-> Columna: DATE (Total √∫nicos: 1825)

                Valor  Frecuencia
0     28-febrero-2018          95
1     28-febrero-2016          94
2     28-febrero-2015          92
3     28-febrero-2017          89
4     28-febrero-2019          85
5       30-abril-2018          58
6  30-septiembre-2017          56
7   30-noviembre-2017          55
8       30-junio-2015          55
9       30-abril-2015          50

   (Se muestran solo los 10 primeros de 1825)

-> Columna: ID_ (Total √∫nicos: 43000)

                                  Valor  Frecuencia
0  993bbbd6-4dbc-4a40-a408-f91f8462bee6           1
1  089b39d8-e4d0-461b-87d4-814d71e0e079           1
2  e9d37224-cb6f-4942-98d7-46672963d097           1
3  3f9f49b5-e410-4948-bf6e-f9244f04918b           1
4  9991fafb-4447-451a-8be2-b0df6098d13e           1
5  eca60b76-70b6-4077-80ba-bc52e8ebb0eb           1
6  d63ede72-0b6d-45b1-8872-385ac6897f65           1
7  5e3483e5-236d-437d-8351-541f9d09b9dd           1
8  9ebb7576-92de-4949-b2e3-e56890740112           1
9  85e7d06a-50c4-4b82-bcb7-45525c7f7f6a           1

   (Se muestran solo los 10 primeros de 43000)